backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [1, 1, 12]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: LSTM
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0, seed: null, stddev: 0.02}
      kernel_regularizer: null
      name: lstm_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      stateful: true
      trainable: true
      unit_forget_bias: true
      units: 144
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: LSTM
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0, seed: null, stddev: 0.02}
      kernel_regularizer: null
      name: lstm_2
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      stateful: true
      trainable: true
      unit_forget_bias: true
      units: 72
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - {}
    name: lstm_2
  - class_name: LSTM
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0, seed: null, stddev: 0.02}
      kernel_regularizer: null
      name: lstm_3
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      stateful: true
      trainable: true
      unit_forget_bias: true
      units: 72
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - lstm_2
        - 0
        - 0
        - {}
    name: lstm_3
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint:
        class_name: MaxNorm
        config: {axis: 0, max_value: 4}
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0, seed: null, stddev: 0.02}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 72
      use_bias: true
    inbound_nodes:
    - - - lstm_3
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dense
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint:
        class_name: MaxNorm
        config: {axis: 0, max_value: 4}
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0, seed: null, stddev: 0.02}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 12
      use_bias: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dense_2
  name: model_1
  output_layers:
  - [dense_2, 0, 0]
keras_version: 2.0.4
