backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [1, 1, 12]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: GRU
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0, seed: null, stddev: 0.02}
      kernel_regularizer: null
      name: gru_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      stateful: true
      trainable: true
      units: 18
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: gru_1
  - class_name: Dropout
    config: {name: dropout_1, rate: 0.45, trainable: true}
    inbound_nodes:
    - - - gru_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: LeakyReLU
    config:
      alpha: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - &id001 !!python/name:numpy.ndarray ''
        - !!python/tuple [0]
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - &id002 !!python/object/apply:numpy.dtype
          args: [f4, 0, 1]
          state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
        - false
        - !!binary |
          zcxMPg==
      name: leaky_re_lu_1
      trainable: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_1
  - class_name: GRU
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0, seed: null, stddev: 0.3}
      kernel_regularizer: null
      name: gru_2
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      stateful: true
      trainable: true
      units: 16
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_1
        - 0
        - 0
        - {}
    name: gru_2
  - class_name: Dropout
    config: {name: dropout_2, rate: 0.45, trainable: true}
    inbound_nodes:
    - - - gru_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: LeakyReLU
    config:
      alpha: !!python/object/apply:numpy.core.multiarray._reconstruct
        args:
        - *id001
        - !!python/tuple [0]
        - !!binary |
          Yg==
        state: !!python/tuple
        - 1
        - !!python/tuple []
        - *id002
        - false
        - !!binary |
          zcxMPg==
      name: leaky_re_lu_2
      trainable: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_2
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config: {mean: 0, seed: null, stddev: 0.2}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 12
      use_bias: true
    inbound_nodes:
    - - - leaky_re_lu_2
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Activation
    config: {activation: tanh, name: activation_1, trainable: true}
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: activation_1
  name: model_1
  output_layers:
  - [activation_1, 0, 0]
keras_version: 2.0.4
